IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G1_EPWM0_CONTROLSS_G1_EPWM0.xml
	<register id="CONTROLSS_G1_EPWM0_TBCTL3" acronym="CONTROLSS_G1_EPWM0_TBCTL3" offset="0xE" width="16" description="Time Base Control Register 3">
		<bitfield id="OSSFRCEN" width="1" begin="0" end="0" resetval="0x0" description="This bit determines which bit sets the EPWMxSYNCOUT One Shot Latch.   0  TBCTL2[OSHTSYNC] sets the One Shot Latch   1  GLDCTL2[OSHTLD] sets the One Shot Latch" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM0_CMPCTL" acronym="CONTROLSS_G1_EPWM0_CMPCTL" offset="0x10" width="16" description="Counter Compare Control Register">
		<bitfield id="LINKDUTYHR" width="1" begin="15" end="15" resetval="0x0" description="CMPAHR, CMPBHR Register Linking:  0 PWMA and PWMB outputs generated independently and CMPAHR, CMPBHR are independent values as on Type-4 1 When this bit is set CMPBHR assumes the same value as CMPAHR. This is typically used in complimentary PWM output generation    [Section 7 details of the operation]" range="15" rwaccess="R/W"/> 
		<bitfield id="LOADBSYNC" width="2" begin="13" end="12" resetval="0x0" description="Shadow to Active CMPB Register Load on SYNC event   00: Shadow to Active Load of CMPB:CMPBHR occurs according to LOADBMODE [bits 1,0] [same as legacy]  01: Shadow to Active Load of CMPB:CMPBHR occurs both according to LOADBMODE bits and when SYNC occurs  10: Shadow to Active Load of CMPB:CMPBHR occurs only when a SYNC is received  11: Reserved  Note: This bit is valid only if CMPCTL[SHDWBMODE] = 0." range="13 - 12" rwaccess="R/W"/> 
		<bitfield id="LOADASYNC" width="2" begin="11" end="10" resetval="0x0" description="Shadow to Active CMPA Register Load on SYNC event   00: Shadow to Active Load of CMPA:CMPAHR occurs according to LOADAMODE [bits 1,0] [same as legacy]  01: Shadow to Active Load of CMPA:CMPAHR occurs both according to LOADAMODE bits and when SYNC occurs  10: Shadow to Active Load of CMPA:CMPAHR occurs only when a SYNC is received  11: Reserved  Note: This bit is valid only if CMPCTL[SHDWAMODE] = 0." range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="SHDWBFULL" width="1" begin="9" end="9" resetval="0x0" description="Counter-compare B [CMPB] Shadow Register Full Status Flag  This bit self clears once a loadstrobe occurs.   0: CMPB shadow FIFO not full yet  1: Indicates the CMPB shadow FIFO is full  a CPU write will overwrite current shadow value" range="9" rwaccess="R"/> 
		<bitfield id="SHDWAFULL" width="1" begin="8" end="8" resetval="0x0" description="Counter-compare A [CMPA] Shadow Register Full Status Flag  The flag bit is set when a 32-bit write to CMPA:CMPAHR register or a 16-bit write to CMPA register is made. A 16-bit write to CMPAHR register will not affect the flag. This bit self clears once a load-strobe occurs.   0: CMPA shadow FIFO not full yet  1: Indicates the CMPA shadow FIFO is full, a CPU write will overwrite the current shadow value" range="8" rwaccess="R"/> 
		<bitfield id="SHDWBMODE" width="1" begin="6" end="6" resetval="0x0" description="Counter-compare B [CMPB] Register Operating Mode   0: Shadow mode. Operates as a double buffer. All writes via the CPU access the shadow register  1: Immediate mode. Only the active compare B register is used. All writes and reads directly access the active register for immediate compare action" range="6" rwaccess="R/W"/> 
		<bitfield id="SHDWAMODE" width="1" begin="4" end="4" resetval="0x0" description="Counter-compare A [CMPA] Register Operating Mode   0: Shadow mode. Operates as a double buffer. All writes via the CPU access the shadow register  1: Immediate mode. Only the active compare register is used. All writes and reads directly access the active register for immediate compare action" range="4" rwaccess="R/W"/> 
		<bitfield id="LOADBMODE" width="2" begin="3" end="2" resetval="0x0" description="Active Counter-Compare B [CMPB] Load From Shadow Select Mode  This bit has no effect in immediate mode [CMPCTL[SHDWBMODE] = 1].   00: Load on CTR = Zero: Time-base counter equal to zero [TBCTR = 0x0000]  01: Load on CTR = PRD: Time-base counter equal to period [TBCTR = TBPRD]  10: Load on either CTR = Zero or CTR = PRD  11: Freeze [no loads possible]" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="LOADAMODE" width="2" begin="1" end="0" resetval="0x0" description="Active Counter-Compare A [CMPA] Load From Shadow Select Mode  This bit has no effect in immediate mode [CMPCTL[SHDWAMODE] = 1].   00: Load on CTR = Zero: Time-base counter equal to zero [TBCTR = 0x0000]  01: Load on CTR = PRD: Time-base counter equal to period [TBCTR = TBPRD]  10: Load on either CTR = Zero or CTR = PRD  11: Freeze [no loads possible]" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM0_CMPCTL2" acronym="CONTROLSS_G1_EPWM0_CMPCTL2" offset="0x12" width="16" description="Counter Compare Control Register 2">
		<bitfield id="LOADDSYNC" width="2" begin="13" end="12" resetval="0x0" description="Shadow to Active CMPD Register Load on SYNC event   00: Shadow to Active Load of CMPD occurs according to LOADDMODE  01: Shadow to Active Load of CMPD occurs both according to LOADDMODE bits and when SYNC occurs  10: Shadow to Active Load of CMPD occurs only when a SYNC is received  11: Reserved  Note: This bit is valid only if CMPCTL2[SHDWDMODE] = 0." range="13 - 12" rwaccess="R/W"/> 
		<bitfield id="LOADCSYNC" width="2" begin="11" end="10" resetval="0x0" description="Shadow to Active CMPC Register Load on SYNC event   00: Shadow to Active Load of CMPC occurs according to LOADCMODE  01: Shadow to Active Load of CMPC occurs both according to LOADCMODE bits and when SYNC occurs  10: Shadow to Active Load of CMPC occurs only when a SYNC is received  11: Reserved  Note: This bit is valid only if CMPCTL2[SHDWCMODE] = 0." range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="SHDWDMODE" width="1" begin="6" end="6" resetval="0x0" description="Counter-Compare D Register Operating Mode   0: Shadow mode - operates as a double buffer. All writes via the CPU access Shadow register.  1: Immediate mode - only the Active compare register is used. All writes/reads via the CPU directly access the Active register for immediate Compare action." range="6" rwaccess="R/W"/> 
		<bitfield id="SHDWCMODE" width="1" begin="4" end="4" resetval="0x0" description="Counter-Compare C Register Operating Mode   0: Shadow mode - operates as a double buffer. All writes via the CPU access Shadow register.  1: Immediate mode - only the Active compare register is used. All writes/reads via the CPU directly access the Active register for immediate Compare action." range="4" rwaccess="R/W"/> 
		<bitfield id="LOADDMODE" width="2" begin="3" end="2" resetval="0x0" description="Active Counter-Compare D [CMPD] Load from Shadow Select Mode   00: Load on CTR = Zero: Time-base counter equal to zero [TBCTR = 0x0000]  01: Load on CTR = PRD: Time-base counter equal to period [TBCTR = TBPRD]  10: Load on either CTR = Zero or CTR = PRD  11: Freeze [no loads possible]  Note: Has no effect in Immediate mode." range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="LOADCMODE" width="2" begin="1" end="0" resetval="0x0" description="Active Counter-Compare C [CMPC] Load from Shadow Select Mode   00: Load on CTR = Zero: Time-base counter equal to zero [TBCTR = 0x0000]  01: Load on CTR = PRD: Time-base counter equal to period [TBCTR = TBPRD]  10: Load on either CTR = Zero or CTR = PRD  11: Freeze [no loads possible]  Note: Has no effect in Immediate mode." range="1 - 0" rwaccess="R/W"/>
	</register>
