IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G1_EPWM0_CONTROLSS_G1_EPWM0.xml
	<register id="CONTROLSS_G1_EPWM0_EPWMXLINK" acronym="CONTROLSS_G1_EPWM0_EPWMXLINK" offset="0x70" width="32" description="EPWMx Link Register [[br]] [[br]]This register controls which EPWMs are linked to other EPWM modules.  The default reset value will vary for each module.  The reset value will link each EPWM module to itself to prevent unintentional linking of modules.">
		<bitfield id="GLDCTL2LINK" width="5" begin="30" end="26" resetval="0x0" description="GLDCTL2 Link Bits  Writes to the GLDCTL2 registers in the ePWM module selected by the following bit selections results in a simultaneous write to the current ePWM module's GLDCTL2 registers.   00000: ePWM1  00001: ePWM2  00010: ePWM3  00011: ePWM4  00100: ePWM5   00101: ePWM6  00110: ePWM7   00111: ePWM8  01000: ePWM9  01001: ePWM10  01010: ePWM11  01011: ePWM12  01100: ePWM13  ...  11111: ePWM32" range="30 - 26" rwaccess="R/W"/> 
		<bitfield id="CMPDLINK" width="5" begin="25" end="21" resetval="0x0" description="CMPD Link Bits  Writes to the CMPD registers in the ePWM module selected by the following bit selections results in a simultaneous write to the current ePWM module's CMPD registers.    00000: ePWM1  00001: ePWM2  00010: ePWM3  00011: ePWM4  00100: ePWM5   00101: ePWM6  00110: ePWM7   00111: ePWM8  01000: ePWM9  01001: ePWM10  01010: ePWM11  01011: ePWM12  01100: ePWM13  ...  11111: ePWM32" range="25 - 21" rwaccess="R/W"/> 
		<bitfield id="CMPCLINK" width="5" begin="20" end="16" resetval="0x0" description="CMPC Link Bits  Writes to the CMPC registers in the ePWM module selected by the following bit selections results in a simultaneous write to the current ePWM module's CMPC registers.   00000: ePWM1  00001: ePWM2  00010: ePWM3  00011: ePWM4  00100: ePWM5   00101: ePWM6  00110: ePWM7   00111: ePWM8  01000: ePWM9  01001: ePWM10  01010: ePWM11  01011: ePWM12  01100: ePWM13  ...  11111: ePWM32" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CMPBLINK" width="5" begin="14" end="10" resetval="0x0" description="CMPB_CMPBHR Link Bits  Writes to the CMPB_CMPBHR registers in the ePWM module selected by the following bit selections results in a simultaneous write to the current ePWM module's CMPB_CMPBHR registers.     00000: ePWM1  00001: ePWM2  00010: ePWM3  00011: ePWM4  00100: ePWM5   00101: ePWM6  00110: ePWM7   00111: ePWM8  01000: ePWM9  01001: ePWM10  01010: ePWM11  01011: ePWM12  01100: ePWM13  ...  11111: ePWM32" range="14 - 10" rwaccess="R/W"/> 
		<bitfield id="CMPALINK" width="5" begin="9" end="5" resetval="0x0" description="CMPA_CMPAHR Link Bits  Writes to the CMPA_CMPAHR registers in the ePWM module selected by the following bit selections results in a simultaneous write to the current ePWM module's CMPA_CMPAHR registers.     00000: ePWM1  00001: ePWM2  00010: ePWM3  00011: ePWM4  00100: ePWM5   00101: ePWM6  00110: ePWM7   00111: ePWM8  01000: ePWM9  01001: ePWM10  01010: ePWM11  01011: ePWM12  01100: ePWM13  ...  11111: ePWM32" range="9 - 5" rwaccess="R/W"/> 
		<bitfield id="TBPRDLINK" width="5" begin="4" end="0" resetval="0x0" description="TBPRD_TBPRDHR Link Bits  Writes to the TBPRD:TBPRDHR registers in the ePWM module selected by the following bit selections results in a simultaneous write to the current ePWM module's TBPRD_TBPRDHR registers.   00000: ePWM1  00001: ePWM2  00010: ePWM3  00011: ePWM4  00100: ePWM5   00101: ePWM6  00110: ePWM7   00111: ePWM8  01000: ePWM9  01001: ePWM10  01010: ePWM11  01011: ePWM12  01100: ePWM13  ...  11111: ePWM32" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM0_EPWMXLINK2" acronym="CONTROLSS_G1_EPWM0_EPWMXLINK2" offset="0x74" width="32" description="EPWMx Link 2 Register [[br]] [[br]]This register controls which EPWMs are linked to other EPWM modules.  The default reset value will vary for each module.  The reset value will link each EPWM module to itself to prevent unintentional linking of modules.">
		<bitfield id="DBFEDLINK" width="5" begin="9" end="5" resetval="0x0" description="DBFED_DBFEDHR Link Bits  Writes to the DBFED:DBFEDHR registers in the ePWM module selected by the following bit selections results in a simultaneous write to the current ePWM module's DBFED_DBFEDHR registers.   00000: ePWM1  00001: ePWM2  00010: ePWM3  00011: ePWM4  00100: ePWM5   00101: ePWM6  00110: ePWM7   00111: ePWM8  01000: ePWM9  01001: ePWM10  01010: ePWM11  01011: ePWM12  01100: ePWM13  ...  11111: ePWM32" range="9 - 5" rwaccess="R/W"/> 
		<bitfield id="DBREDLINK" width="5" begin="4" end="0" resetval="0x0" description="DBRED_DBREDHR Link Bits  Writes to the DBRED:DBREDHR registers in the ePWM module selected by the following bit selections results in a simultaneous write to the current ePWM module's DBRED_DBREDHR registers.   00000: ePWM1  00001: ePWM2  00010: ePWM3  00011: ePWM4  00100: ePWM5   00101: ePWM6  00110: ePWM7   00111: ePWM8  01000: ePWM9  01001: ePWM10  01010: ePWM11  01011: ePWM12  01100: ePWM13  ...  11111: ePWM32" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM0_ETEST" acronym="CONTROLSS_G1_EPWM0_ETEST" offset="0x7A" width="16" description="EPWM Test Register">
		<bitfield id="CMPFIX_OVERRIDE" width="1" begin="0" end="0" resetval="0x1" description="0: Bug fix overriden 1: Bug fix takes effect" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM0_EPWMREV" acronym="CONTROLSS_G1_EPWM0_EPWMREV" offset="0x7C" width="16" description="EPWM Revision Register">
		<bitfield id="TYPE" width="8" begin="15" end="8" resetval="0x5" description="EPWM Type Bits: These bits specify the EPWM type. These bits are changed if the functionality of the EPWM is changed or any feature is added or removed:" range="15 - 8" rwaccess="R"/> 
		<bitfield id="REV" width="8" begin="7" end="0" resetval="0x0" description="EPWM Silicon Revision Bits: These bits specify the EPWM revision. These bits are changed if any bug fixes are performed:" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G1_EPWM0_HRPWMREV" acronym="CONTROLSS_G1_EPWM0_HRPWMREV" offset="0x7E" width="16" description="High Resolution Revision Register">
		<bitfield id="TYPE" width="8" begin="15" end="8" resetval="0x3" description="HRPWM Type Bits: These bits specify the HRPWM type. These bits are changed if the functionality of the HRPWM is changed or any feature is added or removed:" range="15 - 8" rwaccess="R"/> 
		<bitfield id="REV" width="8" begin="7" end="0" resetval="0x0" description="HRPWM Silicon Revision Bits: These bits specify the HRPWM revision. These bits are changed if any bug fixes are performed:" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G1_EPWM0_AQCTLA" acronym="CONTROLSS_G1_EPWM0_AQCTLA" offset="0x80" width="16" description="Action Qualifier Control Register For Output A ">
		<bitfield id="CBD" width="2" begin="11" end="10" resetval="0x0" description="Action When TBCTR = CMPB on Down Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxA output low.  10: Set: force EPWMxA output high.  11: Toggle EPWMxA output: low output signal will be forced high, and a high signal will be forced low." range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="CBU" width="2" begin="9" end="8" resetval="0x0" description="Action When TBCTR = CMPB on Up Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxA output low.  10: Set: force EPWMxA output high.  11: Toggle EPWMxA output: low output signal will be forced high, and a high signal will be forced low." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="CAD" width="2" begin="7" end="6" resetval="0x0" description="Action When TBCTR = CMPA on Down Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxA output low.  10: Set: force EPWMxA output high.  11: Toggle EPWMxA output: low output signal will be forced high, and a high signal will be forced low." range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="CAU" width="2" begin="5" end="4" resetval="0x0" description="Action When TBCTR = CMPA on Up Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxA output low.  10: Set: force EPWMxA output high.  11: Toggle EPWMxA output: low output signal will be forced high, and a high signal will be forced low." range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="PRD" width="2" begin="3" end="2" resetval="0x0" description="Action When TBCTR = TBPRD  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxA output low.  10: Set: force EPWMxA output high.  11: Toggle EPWMxA output: low output signal will be forced high, and a high signal will be forced low." range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="ZRO" width="2" begin="1" end="0" resetval="0x0" description="Action When TBCTR = 0  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxA output low.  10: Set: force EPWMxA output high.  11: Toggle EPWMxA output: low output signal will be forced high, and a high signal will be forced low." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM0_AQCTLA2" acronym="CONTROLSS_G1_EPWM0_AQCTLA2" offset="0x82" width="16" description="Additional Action Qualifier Control Register For Output A ">
		<bitfield id="T2D" width="2" begin="7" end="6" resetval="0x0" description="Action when event occurs on T2 in DOWN-Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxA output low.  10: Set: force EPWMxA output high.  11: Toggle EPWMxA output: low output signal will be forced high, and a high signal will be forced low." range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="T2U" width="2" begin="5" end="4" resetval="0x0" description="Action when event occurs on T2 in UP-Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxA output low.  10: Set: force EPWMxA output high.  11: Toggle EPWMxA output: low output signal will be forced high, and a high signal will be forced low." range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="T1D" width="2" begin="3" end="2" resetval="0x0" description="Action when event occurs on T1 in DOWN-Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxA output low.  10: Set: force EPWMxA output high.  11: Toggle EPWMxA output: low output signal will be forced high, and a high signal will be forced low." range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="T1U" width="2" begin="1" end="0" resetval="0x0" description="Action when event occurs on T1 in UP-Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxA output low.  10: Set: force EPWMxA output high.  11: Toggle EPWMxA output: low output signal will be forced high, and a high signal will be forced low." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM0_AQCTLB" acronym="CONTROLSS_G1_EPWM0_AQCTLB" offset="0x84" width="16" description="Action Qualifier Control Register For Output B ">
		<bitfield id="CBD" width="2" begin="11" end="10" resetval="0x0" description="Action When TBCTR = CMPB on Down Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxB output low.  10: Set: force EPWMxB output high.  11: Toggle EPWMxB output: low output signal will be forced high, and a high signal will be forced low." range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="CBU" width="2" begin="9" end="8" resetval="0x0" description="Action When TBCTR = CMPB on Up Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxB output low.  10: Set: force EPWMxB output high.  11: Toggle EPWMxB output: low output signal will be forced high, and a high signal will be forced low." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="CAD" width="2" begin="7" end="6" resetval="0x0" description="Action When TBCTR = CMPA on Down Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxB output low.  10: Set: force EPWMxB output high.  11: Toggle EPWMxB output: low output signal will be forced high, and a high signal will be forced low." range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="CAU" width="2" begin="5" end="4" resetval="0x0" description="Action When TBCTR = CMPA on Up Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxB output low.  10: Set: force EPWMxB output high.  11: Toggle EPWMxB output: low output signal will be forced high, and a high signal will be forced low." range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="PRD" width="2" begin="3" end="2" resetval="0x0" description="Action When TBCTR = TBPRD  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxB output low.  10: Set: force EPWMxB output high.  11: Toggle EPWMxB output: low output signal will be forced high, and a high signal will be forced low." range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="ZRO" width="2" begin="1" end="0" resetval="0x0" description="Action When TBCTR = 0  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxB output low.  10: Set: force EPWMxB output high.  11: Toggle EPWMxB output: low output signal will be forced high, and a high signal will be forced low." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM0_AQCTLB2" acronym="CONTROLSS_G1_EPWM0_AQCTLB2" offset="0x86" width="16" description="Additional Action Qualifier Control Register For Output B ">
		<bitfield id="T2D" width="2" begin="7" end="6" resetval="0x0" description="Action when event occurs on T2 in DOWN-Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxB output low.  10: Set: force EPWMxB output high.  11: Toggle EPWMxB output: low output signal will be forced high, and a high signal will be forced low." range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="T2U" width="2" begin="5" end="4" resetval="0x0" description="Action when event occurs on T2 in UP-Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxB output low.  10: Set: force EPWMxB output high.  11: Toggle EPWMxB output: low output signal will be forced high, and a high signal will be forced low." range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="T1D" width="2" begin="3" end="2" resetval="0x0" description="Action when event occurs on T1 in DOWN-Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxB output low.  10: Set: force EPWMxB output high.  11: Toggle EPWMxB output: low output signal will be forced high, and a high signal will be forced low." range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="T1U" width="2" begin="1" end="0" resetval="0x0" description="Action when event occurs on T1 in UP-Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxB output low.  10: Set: force EPWMxB output high.  11: Toggle EPWMxB output: low output signal will be forced high, and a high signal will be forced low." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM0_AQSFRC" acronym="CONTROLSS_G1_EPWM0_AQSFRC" offset="0x8E" width="16" description="Action Qualifier Software Force Register">
		<bitfield id="RLDCSF" width="2" begin="7" end="6" resetval="0x0" description="AQCSFRC Active Register Reload From Shadow Options   00: Load on event counter equals zero  01: Load on event counter equals period  10: Load on event counter equals zero or counter equals period  11: Load immediately [the active register is directly accessed by the CPU and is not loaded from the shadow register]." range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="OTSFB" width="1" begin="5" end="5" resetval="0x0" description="One-Time Software Forced Event on Output B   0: Writing a 0 [zero] has no effect. Always reads back a 0. This bit is auto cleared once a write to this register is complete [i.e., a forced event is initiated.]. This is a one-shot forced event. It can be overridden by another subsequent event on output B.  1: Initiates a single software forced event" range="5" rwaccess="R/W1TS"/> 
		<bitfield id="ACTSFB" width="2" begin="4" end="3" resetval="0x0" description="Action When One-Time Software Force B is Invoked   00: Does nothing [action disabled]  01: Clear [low]  10: Set [high]  11: Toggle [Low -> High, High -> Low]  Note: This action is not qualified by counter direction [CNT_dir]" range="4 - 3" rwaccess="R/W"/> 
		<bitfield id="OTSFA" width="1" begin="2" end="2" resetval="0x0" description="One-Time Software Forced Event on Output A   0: Writing a 0 [zero] has no effect. Always reads back a 0. This bit is auto cleared once a write to this register is complete [ i.e., a forced event is initiated].  This is a one-shot forced event. It can be overridden by another subsequent event on output A.  1: Initiates a single software forced event" range="2" rwaccess="R/W1TS"/> 
		<bitfield id="ACTSFA" width="2" begin="1" end="0" resetval="0x0" description="Action When One-Time Software Force A Is Invoked   00: Does nothing [action disabled]  01: Clear [low]  10: Set [high]  11: Toggle [Low -> High, High -> Low]  Note: This action is not qualified by counter direction [CNT_dir]" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM0_AQCSFRC" acronym="CONTROLSS_G1_EPWM0_AQCSFRC" offset="0x92" width="16" description="Action Qualifier Continuous S/W Force Register ">
		<bitfield id="CSFB" width="2" begin="3" end="2" resetval="0x0" description="Continuous Software Force on Output B  In immediate mode, a continuous force takes effect on the next TBCLK edge. In shadow mode, a continuous force takes effect on the next TBCLK edge after a shadow load into the active register. To configure shadow mode, use AQSFRC[RLDCSF].   00: Software forcing is disabled and has no effect  01: Forces a continuous low on output B  10: Forces a continuous high on output B  11: Software forcing is disabled and has no effect" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="CSFA" width="2" begin="1" end="0" resetval="0x0" description="Continuous Software Force on Output A  In immediate mode, a continuous force takes effect on the next TBCLK edge. In shadow mode, a continuous force takes effect on the next TBCLK edge after a shadow load into the active register.   00: Software forcing is disabled and has no effect  01: Forces a continuous low on output A  10: Forces a continuous high on output A  11: Software forcing is disabled and has no effect" range="1 - 0" rwaccess="R/W"/>
	</register>
